/*
2015年2月11日08:21:04
删除数组重复数据 
算法思想:从头依次选定数组中的一个数据元素,
每选定一个元素,便将该元素与其后的所有元素比较,如果相同就删除后者 
*/
# include <stdio.h>

void del(int * p,int * len)  //int * 类型只能接收int类型的地址 
{
	int i,j,k;
	 for(i=0; i<*len; i++)  //从第一个元素开始,跟后面每一个元素进行比较 
	 {
	 	for(j=i+1; j<*len; j++)   //这些就是拿来进行比较的元素 
		 {
		 	if(p[j] == p[i])     //如果发现后面有元素与选定的元素相等,则执行下面 
		 	{
		 	    for(k=j+1; k<*len; k++)
		 	    	p[k-1] = p[k];   //把从第j+1个元素开始后面的元素的值赋给前一个元素,
					                //相当于把第j个元素覆盖掉了 
					                //相当于把数组的j后面的元素向前移一个单位 
				(*len)--;      //每覆盖掉一个元素长度就减一 
		 	}
		 } 
	 }
}

int main(void)
{
	int a[10] = {1,2,2,3,2,435,54,5,43,11};
	int i;
	int len = 10;
	
	del(a,&len);
	
	for(i=0; i<len; i++)   //只输出删除数组元素后剩下的元素个数 
	   printf("%d ",a[i]);
     
	
	return 0 ; 
} 
