/*
打开文件 
*/
# include <stdio.h>
# include <stdlib.h>    //包含exit的声明 

int main(void)
{
	FILE * fp;
	fp = fopen("D:\\sb.txt","rt");
	if(!fp)   //如果因某种原因,文件没被打开,fopen将返回一个空指针值NULL.因此,打开文件的完整语句应该是这样的 
	{
		printf("can't open file s.txt ");
		exit(1);
	}
	
	int fclose(FILE *fp);    //使用文件完毕,要释放文件缓冲区,即关闭文件,相应的系统函数为: 
	/*
		“rt” 只读打开一个文本文件,只允许读数据
		“wt” 只写打开或建立一个文本文件,只允许写数据
		“at” 追加打开一个文本文件,并在文件末尾写数据
		“rb” 只读打开一个二进制文件,只允许读数据
		“wb” 只写打开或建立一个二进制文件,只允许写数据
		“ab” 追加打开一个二进制文件,并在文件末尾写数据
		“rt+” 读写打开一个文本文件,允许读和写
		“wt+” 读写打开或建立一个文本文件,允许读写
		“at+” 读写打开一个文本文件,允许读,或在文件末追加数据
		“rb+” 读写打开一个二进制文件,允许读和写
		“wb+” 读写打开或建立一个二进制文件,允许读和写
		“ab+” 读写打开一个二进制文件,允许读,或在文件末追加数据
	*/
	
	return 0;
} 
