/*
2015年1月27日19:16:13
二维数组的初始化 
*/
# include <stdio.h>
int main(void)
{
   //int a[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
   
   int a[3][4] = {
			      {1, 2, 3,  4},     //这种定义与上面的一样的 
				  {5, 6, 7,  8}, 
				  {9, 10,11,12}      //全部选中这些元素按tab键可以向后后退 
				                       //全部选中这些元素按shift+tab键可以 前进 
   };	
    
    int i,j;
    
    //输出数组内容 
    for(i=0;i<=2;i++)
    {
    	for(j=0;j<=3;j++)
       
		printf("%-5d",a[i][j]); //%d中间加一个-5就对齐了，负号表示左对齐，5表示中间距离占5个光标的位置 
		printf("\n");
    }
    
   return 0;
}

