/*
2015年2月6日09:47:18
位运算符 
&(按位与)功能  :信息采集   eg:一个数据a过来了,用0101去给他与,看结果就可以分析得出a的二进制,从而得出a 
*/

# include <stdio.h>

int main(void)
{
	int i = 5;   //i的二进制是0101 
	int j = 7;   //j的二进制是0111
	             //相与的话得 0101  这个刚好是十进制5 
				 //1为真,0为假,真与真为真,假与真为假 
	int k;
	
	k = i & j;   //位运算符  & :表示表示i与j的每一位二进制进行相与 
	printf("%d\n",k); //5
	
	k = i && j;  //逻辑运算符  只有0和1两种状态  0为假,1为真 
	printf("%d\n",k);  //这里真并且真 为真   所以输出为1 
	
	i = -5;    //5的二进制 0101
	           //取反      1010
			   //末尾加1   1011   这就是-5的二进制 
 	j = 10;    //10的二进制1010 
	           //与出来得  1010
	k = i & j;    
	printf("%d\n",k);
	return 0;
} 
