/*
2015年1月30日09:20:25
指针与一维数组下标的关系 
*/
#include<stdio.h>

void f(int * p,int len)     //修改下面一维数组的第四个的值    
                             //下面把a(数组名，即第一个元素的地址)发送给p指针，所以p指向了 第一个元素
							 //*p相当于第一个元素    *（p+1）:第二个   *（p+2）:第三个  。。。 
{
	      //    *(p + 3) = 233;   //这里的*（p+3） 相当于下面的a[3]  也就是第四个 
	      p[3] = 233;   //这个表达式和上面那个表达式（*(p + 3) = 233;）的功能是以一样的 
	                     //*(p + 3) == p[3]   等价的 
}

int main(void)
{
	int a[6] = {1,2,3,4,5,6};
	
	printf("%d\n",a[3]);  //这里a[3] = 4 
	f(a,6);
	printf("%d\n",a[3]);
	
   return 0;
} 
