/*
2015年1月29日11:13:24
初识指针 
*/ 

#include<stdio.h>
int main(void)
{
	int * p;// p是变量的名字，int* 表示存放的是int类型变量的地址
	       // int * p不表示定义了一个名字叫*p的变量
		   //int * p；应该这样理解：p是变量名，p变量的数据类型是 int *类型
		   //所谓 int *；类型就是存放int变量地址的类型 
	int i;
	
	i = 2;
	p = &i;
	/*
	  1.p保存了I的地址，因此P指向i
	  2.p不是i,i也不是p,更准确的说：修改P的值不影响I的值，修改I的值不应响P的值
	  3.如果一个指针变量指向了某个普通变量，则
	      *指针变量   就等同于   普通变量
		  
		 例子：
		      如果p是个指针变量，并且P存放了普通变量I的地址
			  则P就指向了普通变量i
			  *p 就等同于I
			  或者说 ：在所有出现*p的地方都可以替换成i 
	*/ 
	printf("*p = %d, i = %d",*p,i);
	return 0;
} 
