/*
2015年4月20日21:51:06
7.4 习题七 用递归法将一个整数转换为字符串 
*/
# include <stdio.h>
# include <string.h>

void bb(int n)
{
	/*举例说明该函数流程,假如输入123,123/10后得12,余数是3
		再次运行convert函数,12/10得1,余数是2
		再次运行convert函数,1/10得0,余数是1
		至此,递归结束,开始打印数字,首先打印最后一次递归的结果1
		然后打印倒数第二次的结果2
		最后打印3,输出123    */
	int s;
	if((s=n/10)!=0)
	  bb(s); 
	putchar(n%10+'0');  //每次除10取余数，加'0'转化为字符，一个个反序输出 
	               //打印余数,余数是1则打印字符1,以此类推
	              //调用自身这个函数，把i的现值传递到convert函数进行递
                 //归，以此类推，直到(i=n/10)=0时，停止递归，一步步返回
} 

int main(void)
{
    int n;
	printf("请输入一个整数:\n");	
	scanf("%d",&n);
	bb(n);
	
	return 0; 
} 
